/**** FileVault Strings and Formatting *****/

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting encrypted.  The %@ is replaced by the user's full name. */
"ENCRYPTING_MESSAGE_FORMAT" = "Salataan käyttäjän %@ kotikansiota";

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting decrypted.  The %@ is replaced by the user's full name. */
"DECRYPTING_MESSAGE_FORMAT" = "Puretaan käyttäjän %@ kotikansion salausta";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder getting compacted.  The %@ is replaced by the user's full name. */
"COMPACTING_MESSAGE_FORMAT" = "Palautan levytilaa käyttäjän %@ kotikansiosta";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder being backed up by TimeMachine.  The %@ is replaced by the user's full name. */
"BACKINGUP_MESSAGE_FORMAT" = "Varmuuskopioidaan käyttäjän %@ kotikansiota";

"CONVERTING_MESSAGE_FORMAT" = "Muunnetaan käyttäjän %@ kotikansiota";

/* The following strings appear below the progress bar in the FileVault conversion progress window to indicate the various phases of the conversion process. */
"PHASE_PREPARING" = "Valmistelen...";
"PHASE_CREATING_IMAGE" = "Luon FileVaultia...";
"PHASE_MOUNTING_IMAGE" = "Tuodaan FileVaultia näkyviin...";
"PHASE_COPYING_TO_IMAGE" = "Kopioidaan kotikansion sisältöä FileVaultiin...";
"PHASE_COPY_COMPLETE" = "Kopiointi on suoritettu…";
"PHASE_UPDATING_USER_RECORD" = "Päivitän käyttäjätietuetta...";
"PHASE_UNMOUNTING_IMAGE" = "Poistetaan FileVaultia näkyvistä...";
"PHASE_DELETING_OLD_HOME" = "Poistetaan vanhaa kotikansiota...";
"PHASE_SECURE_ERASING_OLD_HOME" = "Poistetaan edellistä kotikansiota turvallisesti…";
"PHASE_CANCELLING" = "Kumoan...";
"PHASE_PAUSED" = "Keskeytetty";
"PHASE_COMPACTING" = "Palautan levytilaa...";
"PHASE_BACKINGUP" = "Varmuuskopioidaan...";

/* The following strings are time estimates that appear below the progress bar in the FileVault conversion progress window */
"TIME_EST_ESTIMATING" = "Arvioin...";
"TIME_EST_ABOUT_5_SECONDS" = "Noin 5 sekuntia";
"TIME_EST_ABOUT_10_SECONDS" = "Noin 10 sekuntia";
"TIME_EST_UNDER_A_MINUTE" = "Alle minuutti";
"TIME_EST_ABOUT_A_MINUTE" = "Noin minuutti";
"TIME_EST_ABOUT_N_MINUTES" = "Noin %d minuuttia";
"TIME_EST_ABOUT_ONE_HOUR" = "Noin 1 tunti";
"TIME_EST_ABOUT_ONE_HOUR_N_MINUTES" = "Noin 1 tunti ja %d minuuttia";
"TIME_EST_ABOUT_PLURAL_HOURS" = "Noin %d tuntia";
"TIME_EST_ABOUT_PLURAL_HOURS_PLURAL_MINUTES" = "Noin %1$d tuntia ja %2$d minuuttia";


"TIME_REMAINING_FORMAT" = "Aikaa jäljellä: %@";
"CANCEL_BUTTON_LABEL" = "Kumoa";

/* The following strings are used to construct the confirmation alert that is presented when a user clicks the Cancel button in the FileVault progress window. */

"CANCEL_CONFIRMATION_STOP_BUTTON" = "Pysäytä";
"CANCEL_CONFIRMATION_CONTINUE_BUTTON" = "Jatka";
"CANCEL_ENCRYPT_CONFIRMATION_MESSAGE" = "Haluatko varmasti pysäyttää FileVaultin?";
"CANCEL_ENCRYPT_CONFIRMATION_INFO" = "FileVault ei ole salannut kotikansiota loppuun asti. Jos pysäytät nyt, kotikansion FileVault kytketään pois päältä eikä sitä salata.";
"CANCEL_DECRYPT_CONFIRMATION_MESSAGE" = "Haluatko varmasti pysäyttää FileVaultin?";
"CANCEL_DECRYPT_CONFIRMATION_INFO" = "FileVault ei ole purkanut kotikansiota salausta loppuun asti. Jos pysäytät nyt, kotikansion FileVault kytketään päälle ja se jää salatuksi.";

/* The following strings are used to construct the confirmation alert that is presented when a user when a compact is necessary during log out. */

"COMPACT_CONFIRMATION_CONTINUE_BUTTON" = "Jatka";
"COMPACT_CONFIRMATION_SKIP_NOW_BUTTON" = "Ohita nyt";

"COMPACT_CONFIRMATION_MESSAGE" = "FileVaultin suojaama kotikansio käyttää tarpeettoman paljon levytilaa. FileVault voi palauttaa levytilan. Haluatko jatkaa?";

"COMPACT_CONFIRMATION_INFO" = "Kun osoitat Jatka, FileVault palauttaa käyttämättömän levytilan. Vaikka tämä prosessi kestää jonkin aikaa, kannattaa antaa FileVaultin palauttaa levytila.";


/* Error Alert strings */
"FV_ERROR_OK_BUTTON" = "OK";
"FV_ERROR_TITLE" = "Tapahtui virhe";
"FILEVAULT_ENCRYPT_ERROR_MESSAGE" = "Salauksen aikana tapahtui virhe (%@). FileVaultia ei kytketä päälle tälle tunnukselle.";
"FILEVAULT_DECRYPT_ERROR_MESSAGE" = "Salauksen purkamisen aikana tapahtui virhe (%@). FileVaultia ei kytketä pois päältä tältä tunnukselta.";
"FV_COULD_NOT_CREATE_IMAGE" = "FileVault-levytiedoston luominen ei onnistunut";
"FV_COULD_NOT_CREATE_MOUNT_POINT_DIR" = "Väliaikaista liitoshakemistoa ei voitu luoda";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_COPYING" = "FileVault-levytiedostoa ei voitu tuoda näkyviin kopiointia varten";
"FV_ERROR_OCCURRED_DURING_COPY" = "Kopioinnin aikana tapahtui virhe.";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_VERIFICATION" = "FileVault-levytiedostoa ei voitu tuoda näkyviin tarkistusta varten";
"FV_VERIFICATION_FAILED" = "Varmentaminen epäonnistui";
"FV_COULD_NOT_UNMOUNT_IMAGE" = "FileVault-levytiedostoa ei voitu poistaa näkyvistä";
"FV_ERROR_DEFAULT" = "Virhe %d";

"FV_SECURE_ERASE_FINISHED_TITLE" = "Edellinen kotikansio on poistettu turvallisesti.";
"FV_SECURE_ERASE_FINISHED_INFO" = "FileVault-suojaus on nyt tilisi käytössä ja kotikansiosi sisältö on salattu.";
"FV_SECURE_ERASE_FAILED_TITLE" = "Ongelma poistettaessa edellistä kotikansiota turvallisesti FileVault-muunnosprosessin aikana.";
"FV_SECURE_ERASE_FAILED_INFO" = "Turvallinen poistoprosessi epäonnistui ennen kuin edellisen kotihakemiston poisto suoritettiin loppuun.";
"FV_CONTINUE_TITLE" = "Haluatko varmasti jatkaa edellisen kotikansion poistamista taka-alalla?";
"FV_CONTINUE_INFO" = "Osoittamalla ”OK” FIleVault viimeistelee edellisen kotikansion turvallisen poiston samalla kun työskentelet. Tarkista poistoprosessin tila avaamalla Järjestelmäasetukset > Turvallisuus.";